'''
Assignment 6: เกณฑ์คำนวณค่าดัชนีมวลกาย (BMI)
Code จาก Assignment 1 นำมาคำนวณจต่อ
น้อยกว่า 18.50	น้ำหนักน้อย / ผอม
18.50 - 22.90	ปกติ (สุขภาพดี)
23 - 24.90	ท้วม / โรคอ้วนระดับ 1
25 - 29.90	อ้วน / โรคอ้วนระดับ 2
มากกว่า 30	อ้วนมาก / โรคอ้วนระดับ 3
'''


weight = int(input('ป้อนน้ำหนักของคุณ (kg) : '))
high = int(input('ป้อนส่วนสูงของคุณ (cm) : ')) / 100 # แปลงส่วนสูงจาก เซนติเมตร เป็น เมตร
bmi = weight / (high**2) #(high*high)

if bmi >= 30:
    result = 'อ้วนมาก / โรคอ้วนระดับ 3'
elif bmi >= 25 and bmi <= 29.9:
    result = 'อ้วน / โรคอ้วนระดับ 2'
elif bmi >= 23 and bmi <= 24.9:
    result = 'ท้วม / โรคอ้วนระดับ 1'
elif bmi >= 18.50 and bmi <= 22.9:
    result = 'ปกติ (สุขภาพดี)'
elif bmi < 18.50:
    result = 'น้ำหนักน้อย / ผอม'
else:
    result = 'ยังไม่ทราบค่าที่แน่ชัด'

print('ค่า BMI : ', bmi, '\n' + 'อยู่ในเกณฑ์ : ' + result)